tutorials/cfdemSolverPimple/DiscreteMagnificationLensPaperCases/ParticleJetCases/dilute/CFD/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{

    inletGas
    {
        type            zeroGradient;
    }

    InletSolidLeft
    {
        type            zeroGradient;
    }

    InletSolidRight
    {
        type            zeroGradient;
    }

    walls
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    frontAndBackPlanes    
    {
        type            empty;
    }

}

// ************************************************************************* //
