tutorials/cfdemSolverPimple/DiscreteMagnificationLensPaperCases/ParticleJetCases/dilute/CFD/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    
    {
        name    inletFaceSetLeft;           //name of the new set to be created
        type    faceSet;                  // is it a cellSet or faceSet?
        action  new;                        // is it new or appending?
        source  boxToFace;             // extracting faces from the defined box 
        sourceInfo                          // box details 
        {
             box (-0.001 -0.001 -0.001)(0.000 0.091 0.0181); //need to select the outer layer cells
        }
    }
     
     
    {
        name    inletFaceSetRight;           //name of the new set to be created
        type    faceSet;                  // is it a cellSet or faceSet?
        action  new;                        // is it new or appending?
        source  boxToFace;             // extracting faces from the defined box 
        sourceInfo                          // box details 
        {
             box (0.0899 -0.001 -0.001)(0.092 0.091 0.0181); //need to select the outer layer cells
        }
    }    
     
);


// ************************************************************************* //
